<template>
  <div class="box">
    <div class="nav">
      <h2>民法经典案例</h2>
      <ul ref="ul">
      <li v-for="(item,index) in List" :key="index" :class="{red : index===0}" @click="rwclick(index)">{{ item.title }}</li>
      </ul>
    </div>
    <div class="ziBox">
      <div class="textBox">
            <div class="title">{{ title }}</div>
            <div class="text1 t">
                <div class="h2">基本案情</div>
                <div class="text">{{text1}}</div>
            </div>
            <div class="text2 t">
                <div class="h2">裁判结果</div>
                <div class="text">{{text2}}</div>
            </div>
            <div class="text3 t">
                <div class="h2">争议焦点</div>
                <div class="text">{{text3}}</div>
            </div>
            <div class="text4 t" >
                <div class="h2">裁判意见</div>
                <div class="text">{{ text4 }}</div>
            </div>
            <div class="text5 t">
                <div class="h2">相关法条</div>
                <div class="text">{{ text5 }}</div>
            </div>
            <div class="text6 t">
                <div class="h2">典型意义</div>
                <div class="text">{{ text6 }}</div>
            </div>
        </div>
      <div class="get" @click="$router.push('/FuCivil')">
        <i class="iconfont icon-likai"></i>
        <span>返回</span>
      </div>
      <div class="textbg"></div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'CaseIndex',
  data () {
    return {
      List: [
        {
          title: '中国反暴力网络第一案',
          text1: '2007年年底，姜岩因丈夫王菲有了第三者欲与自己离婚，从24楼跳下身亡，自杀前在博客中记录了丈夫的不忠和她生命最后2个月的心路历程，并公布了丈夫和第三者的照片。2008年姜岩的大学同学张乐奕在其注册的网站「北飞的候鸟」上刊登了《哀莫大于心死》等文章;海南天涯在线网络科技有限公司注册管理的天涯虚拟社区网出现了《大家好，我是姜岩的姐姐》一帖。每篇网文后，都有大量网友留言，对王菲的行为表示不耻和痛骂。网友据此对两人展开「人肉搜索」，王菲、第三者甚至两人父母的个人资料均被公开于网络，除在网络上遭到指名道姓的谩骂之外，当事人的现实生活也受到重大影响。之后，王菲以侵犯隐私权和名誉权为由起诉相关网站，法院判决三名被告侵权',
          text2: '北京市朝阳区人民法院一审判决张乐奕和北京凌云公司构成对王菲隐私权和名誉权的侵犯。北京二中院作出二审宣判原审法院认定张某侵犯了王某的名誉权事实清楚、适用法律正确，法院予以维持。',
          text3: '隐私权和知情权、表达自由的冲突问题',
          text4: '二审法院认为，张某作为“北飞的候鸟”网站的管理者未尽到应尽的管理责任，泄露王某个人隐私的行为已构成对王某的名誉权的侵害，张某应当对此承担相应的民事责任。另，相关证据虽能证明在张某2008年1月11日开办“北飞的候鸟”网站前，部分网民已在其他网站披露了姜某自杀事件的经过，其间对王某的个人情况已有披露，但应当指出，他人对王某个人信息的披露不意味着张某可以继续对此予以披露、传播，他人此前对王某个人信息的披露不影响张某侵犯王某名誉权的事实成立。',
          text5: '《民法典》第111条:自然人的个人信息受法律保护。任何组织或者个人需要获取他人个人信息的，应当依法取得并确保信息安全，不得非法收集、使用、加工、传输他人个人信息，不得非法买卖、提供或者公开他人个人信息。《民法典》第990条:人格权是民事主体享有的生命权、身体权、健康权、姓名权、名称权、肖像权、名誉权、荣誉权、隐私权等权利。《民法典》第1032条:自然人享有隐私权。任何组织或者个人不得以刺探、侵扰、泄露、公开等方式侵害他人的隐私权。隐私是自然人的私人生活安宁和不愿为他人知晓的私密空间、私密活动、私密信息。',
          text6: '时至今日，《民法典》强化了对隐私的保护，很好的回应了科技进步和数据爆炸的互联网、大数据、高科技时代带来的一系列问题。《民法典》第1032条首次提出私人生活安宁权，即隐私是自然人的私人生活安宁和不愿为他人知晓韵私密空间、私密活动、私密信息。'
        },
        {
          title: '彭宇案',
          text1: '2006年11月20日上午约9点半，64岁的退休职工徐寿兰买完菜在南京水西门广场公交站准备乘车回家，这时接连进站3辆公交车，后面两辆83路正是徐寿兰要乘坐的车。由于前面一辆车人比较多，徐寿兰一路小跑着去追第3辆车。这时，26岁的小伙彭宇正从第二辆公交车后门下来准备转车。他感觉背部和人撞了一下，回头一看，没有人，却听到地上有呻吟声。原来是个老太太摔倒了。彭宇见状顾不上再转车，马上将徐寿兰扶起，并和随后赶到的徐寿兰儿子一起将她送往医院，留下200元医药费后，彭宇就离开了。',
          text2: '一审法院酌定被告补偿原告损失的百分之四十较为适宜。彭宇不服判决，提出上诉，双方在二审中达成和解。',
          text3: '1、原被告是否相撞 2、被告应否承担原告的损失',
          text4: '关于原被告是否相撞，法院认为，根据被告自认，其是第一个下车之人，从常理分析，其与原告相撞的可能性较大。 关于被告应否承担原告损失，法院认为，根据根据前述分析，原告系在与被告相撞后受伤且产生了损失，原、被告对于该损失应否承担责任，应根据侵权法诸原则确定。本案中，原告在乘车过程中无法预见将与被告相撞;同时，被告在下车过程中因为视野受到限制，无法准确判断车后门左右的情况，故对本次事故双方均不具有过错。因此，本案应根据公平责任合理分担损失。根据本案案情，本院酌定被告补偿原告损失的40%较为适宜。',
          text5: '《民法通则》第98条:公民享有生命健康权。《民法通则》第119条:侵害公民身体造成伤害的，应当赔偿医疗费、因误工减少的收入、残废者生活补助费等费用;造成死亡的，并应当支付丧葬费、死者生前扶养的人必要的生活费等费用。',
          text6: '中国政法大学法学院何兵认为，这类涉及社会底线的案件是不能庭下调解的。这种以“调解”解决问题的方式，给公众传达的信号是不明确的，和解意味着木该清晰的边界刻意被模糊掉了，由此带来的“破窗效应”是非常可怕的。彭宇案对于社会的最大伤害，就在于它模糊了一个基本价值观一一好人有好报。人们希望这个边界被重新界定清晰。“法庭从来不单单是一个审判室，还是一个代表法律程序、法理精神的地方。”电影《纽伦堡审判》的导演丹利·克莱默借台词阐释法理，“(审判)目的不是让少数人绳之以法，而是重新确立法律秩序的神圣地位，找到全世界为之依赖的正义法规。”'
        },
        {
          title: '无锡胚胎案',
          text1: '沈某与刘某都是独生子女，两人于2010年10月登记结婚。2012年8月，因自然生育困难，沈某与刘某到南京市鼓楼医院，通过人工辅助生殖方式培育了13枚受精胚胎，其中4枚符合移植标准。2013年3月，夫妻二人因交通事故死亡。夫妻双方的父母就4枚冷冻胚胎的监管权和处置权产生争议，诉诸法院。',
          text2: '审法院判决驳回沈某南、邵某妹(沈某父母)的诉讼请求市法院作出终市判决:撤销一审判决:沈某夫妇存放于南京鼓楼医院的4枚冷冻胚胎由双方父母共同监管和处置。',
          text3: '涉案胚胎的监管权和处置权的行使主体如何确定?',
          text4: '审法院经审理认为，受精胚胎具有发展为生命的潜能，是含有未来生命特征的特殊之物，不能像一般物一样任意转让或继承，故其不能成为继承的标的。二审法院认为，在我国现行法律对胚胎的法律属性没有明确规定的情况下，结合本案实际，应考虑以下因素以确定胚胎的相关权利归属:一是伦理:胚胎具有潜在的生命特质，不仅含有沈杰，刘曦的DNA等物质，而且含有双方父母两个家族的遗传信息，双方父母与涉案胚胎亦具有生命伦理上的密切关联性。二是情感:沈杰、刘曦遗留下来的胚胎，成为双方家族血脉的唯一载体，承载着爱思寄托、精神慰藉、情感抚慰等人格利益。三是特殊利益保护:胚胎具有孕育生命的前置，比非生命体具有更高的道德地位，应受到特殊尊重与保护。双方父母不仅是世界上唯一关系胚胎命运的主体，而且亦应当是胚胎之最近最大和最密切倾向性利益的享有者。双方父母享有涉案胚胎的监管权和处置权于情于理是恰当的。',
          text5: '《民法典》第1090条:从事与人体基因、人休胚胎等有关的医学和科研活动，应当遵守法律、行政法规和国家有关规定，不得危害人体健康，不得违背伦理道德，不得损害公共利益。',
          text6: '此案是在我国对人体冷冻胚胎法律属性无统一立法、代孕需求旺盛但被禁止的背景下产生的。二审法院在法律空白背景下作出情、理、法兼顾的判决，一方面对于本案当事人的合法权益维护具有实质意义，另一方面对我国未来人工生殖、冷冻胚胎立法提供了实务素材。不少专家学者认为，本案的终审判决秉承了人文精神，充分展示了司法裁判对公民权利的尊重，尤其是对生命给予了充分尊重。'
        },
        {
          title: '超市拿鸡蛋被拦猝死案',
          text1: '2020年6月13日下午，67岁的谷某在崇川区辉田日用品超市购物时，口袋里放了两只鸡蛋未结账便欲离开，因被超市员工发现并拦下询问，谷某便返回超市内。但在将两只鸡蛋悄悄放回超市置物柜后，谷某却突然倒地。超市员工立即拨打 110报警，亦有群众对谷某进行心肺复苏。救护人员及时赶到超市进行急救，并将谷某送至南通市中医院抢救。谷某后因抢救无效于当天死亡，死亡原因推断为心肌梗死。谷某某、杜某系谷某亲属，提起诉讼要求辉田超市对谷某的死亡后果承担50%赔偿责任，共计381742元。',
          text2: '一审判决驳回原告诉讼请求。二审驳回上诉，维持原判。',
          text3: '1、辉田超市是否应对谷某因争执倒地承担侵权责任2、辉田超市在谷某倒地后是否尽到安全保障义务',
          text4: '二审法院认为:首先，关于辉田超市是否存在过错的问题。辉田超市员工与谷某素不相识，更不清楚其身体状况，对其突发疾病倒地无法预见，对谷某倒地死亡不存在过错。其次，关于劝阻行为是否违法的问题。辉田超市作为谷某不当行为的直接利益相关方，其员工拉扯谷某衣袖，继续与谷某交谈，制止不当行为的举措更具有正当性，更应受到法律的保护。再者，关于劝阻行为与损害后果是否存在因果关系的问题。本案中，从辉田超市员工与谷某交涉到谷某倒地，前后不到3分钟。辉田超市员工的劝阻方式、内容和时长均在合理限度内。故从社会一般观念来看，该行为通常并不会造成谷某突发疾病倒地。',
          text5: '',
          text6: '本案旗帜鲜明地宣示，公平责任不应成为“和稀泥”的法律依据，任何人都不能将自身应承担的风险转嫁他人，不是所有损害都应由他人来赔偿填补，损害发生如果不具有法定原因，不能要求他人承担侵权赔偿责任。本案从平衡权益保护和行为自由的角度，重申了杜绝结果责任主义的价值导向，符合民法典有关公平责任的规定精神。人民法院通过本案裁判，大力弘扬社会主义核心价值观，引导公众采取合法、适度的方式维护自身权益，引领了诚信、友善、文明的社会风尚。'
        },
        {
          title: '闻天公司诉李琛茹确认合同无效案',
          text1: '闻天公司(房地产公司)与李琛茹签订了商品房内部认购合同书，该认购合同约定了双方的名称、住所、房屋的基本情况、单价、总价款、付款方式、付款时间等内容。合同签订当日，李琛茹即向某房地产公司交纳全部购房款。其后，闻天公司在案涉开发项目已经取得土地使用证、建设用地规划许可证、建设工程规划许可证与建筑工程施工许可证的情况下，以案涉房屋未取得商品房预售许可证为由，将李琛茹某起诉至法院，请求确认双方签订的内部认购合同无效。',
          text2: '一审法院判决房地产公司与李某某签订的认购合同无效。二审法院判决撤销一审判决，驳回房地产公司确认合同无效的诉讼请求。',
          text3: '1、双方当事人之间是否商品房预售合同法律关系 2、如双方当事人之间已经形成商品房预售合同法律关系，其效力如何认定',
          text4: '二审法院认为，双方之间形成了商品房预售合同法律关系。认购合同的名称虽为“紫杉庄园内部认购合同”，但合同对买卖双方当事人名称、商品房基本情况、商品房价款、付款方式、付款时间等内容进行了明确约定，合同内容已经具备了商品房预售合同的主要条款。并且，在合同签订当日支付了全额购房款，诉讼中闻天公司也没有对李琛茹履行合同的行为行为提出抗辩，标明双方当事人同意对商品房预售合同实际履行。双方在诉讼中均认可认购合同实质是商品房预售合同李琛茹在签订认购合同当日即支付了全额购房款，闻天公司在自身合同目的已经实现情形下，非但不积极履行应尽的合同义务，面对房地产市场出现价格大幅上涨，反而主张合同无效的做法，显然违背诚实信用原则。闻天公司签约时未取得商品房预售许可证，虽然违反了有关“商品房预售应当取得商品房预售许可证明”的规定，但是并不必然导致其签订认购合同的民事法律行为无效。',
          text5: '1.人格权保护的一般规定：第九百九十一条规定，民事主体的人格权受法律保护，任何组织或者个人不得侵害。2.侵权责任的过错认定：第一千一百六十四条规定，行为人因过错侵害他人民事权益造成损害的，应当承担侵权责任。依照法律规定推定行为人有过错，其不能证明自己没有过错的，应当承担侵权责任。《中华人民共和国消费者权益保护法》：第十八条规定，经营者应当保证其提供的商品或者服务符合保障人身、财产安全的要求。对可能危及人身、财产安全的商品和服务，应当向消费者作出真实的说明和明确的警示，并说明和标明正确使用商品或者接受服务的方法以及防止危害发生的方法。宾馆、商场、餐馆、银行、机场、车站、港口、影剧院等经营场所的经营者，应当对消费者尽到安全保障义务。',
          text6: '本案从平衡权益保护和行为自由的角度，重申了杜绝结果责任主义的价值导向，符合民法典有关公平责任的规定精神。人民法院通过本案裁判，大力弘扬社会主义核心价值观，引导公众采取合法、适度的方式维护自身权益，引领了诚信、友善、文明的社会风尚。'
        }
      ],
      title: '中国反暴力网络第一案',
      text1: '2007年年底，姜岩因丈夫王菲有了第三者欲与自己离婚，从24楼跳下身亡，自杀前在博客中记录了丈夫的不忠和她生命最后2个月的心路历程，并公布了丈夫和第三者的照片。2008年姜岩的大学同学张乐奕在其注册的网站「北飞的候鸟」上刊登了《哀莫大于心死》等文章;海南天涯在线网络科技有限公司注册管理的天涯虚拟社区网出现了《大家好，我是姜岩的姐姐》一帖。每篇网文后，都有大量网友留言，对王菲的行为表示不耻和痛骂。网友据此对两人展开「人肉搜索」，王菲、第三者甚至两人父母的个人资料均被公开于网络，除在网络上遭到指名道姓的谩骂之外，当事人的现实生活也受到重大影响。之后，王菲以侵犯隐私权和名誉权为由起诉相关网站，法院判决三名被告侵权',
      text2: '北京市朝阳区人民法院一审判决张乐奕和北京凌云公司构成对王菲隐私权和名誉权的侵犯。北京二中院作出二审宣判原审法院认定张某侵犯了王某的名誉权事实清楚、适用法律正确，法院予以维持。',
      text3: '隐私权和知情权、表达自由的冲突问题',
      text4: '二审法院认为，张某作为“北飞的候鸟”网站的管理者未尽到应尽的管理责任，泄露王某个人隐私的行为已构成对王某的名誉权的侵害，张某应当对此承担相应的民事责任。另，相关证据虽能证明在张某2008年1月11日开办“北飞的候鸟”网站前，部分网民已在其他网站披露了姜某自杀事件的经过，其间对王某的个人情况已有披露，但应当指出，他人对王某个人信息的披露不意味着张某可以继续对此予以披露、传播，他人此前对王某个人信息的披露不影响张某侵犯王某名誉权的事实成立。',
      text5: '《民法典》第111条:自然人的个人信息受法律保护。任何组织或者个人需要获取他人个人信息的，应当依法取得并确保信息安全，不得非法收集、使用、加工、传输他人个人信息，不得非法买卖、提供或者公开他人个人信息。《民法典》第990条:人格权是民事主体享有的生命权、身体权、健康权、姓名权、名称权、肖像权、名誉权、荣誉权、隐私权等权利。《民法典》第1032条:自然人享有隐私权。任何组织或者个人不得以刺探、侵扰、泄露、公开等方式侵害他人的隐私权。隐私是自然人的私人生活安宁和不愿为他人知晓的私密空间、私密活动、私密信息。',
      text6: '时至今日，《民法典》强化了对隐私的保护，很好的回应了科技进步和数据爆炸的互联网、大数据、高科技时代带来的一系列问题。《民法典》第1032条首次提出私人生活安宁权，即隐私是自然人的私人生活安宁和不愿为他人知晓韵私密空间、私密活动、私密信息。'
    }
  },
  methods: {
    rwclick (index) {
      const li = this.$refs.ul.querySelectorAll('li')
      li.forEach((item, id) => {
        item.classList.remove('red')
      })
      li[index].classList.add('red')
      this.title = this.List[index].title
      this.text1 = this.List[index].text1
      this.text2 = this.List[index].text2
      this.text3 = this.List[index].text3
      this.text4 = this.List[index].text4
      this.text5 = this.List[index].text5
      this.text6 = this.List[index].text6
    }
  },
  mounted () {
    const index = this.$route.query.text
    if (index) {
      const li = this.$refs.ul.querySelectorAll('li')
      li.forEach((item, id) => {
        item.classList.remove('red')
      })
      li[index].classList.add('red')
      this.title = this.List[index].title
      this.text1 = this.List[index].text1
      this.text2 = this.List[index].text2
      this.text3 = this.List[index].text3
      this.text4 = this.List[index].text4
      this.text5 = this.List[index].text5
      this.text6 = this.List[index].text6
    }
  }
}
</script>

<style scoped>
    @keyframes op2 {
    0%{
        opacity: 0;
        transform: translate(-30px,0);
        filter: blur(4px);
    }
    60% {
      opacity: 0.6;
      transform: translate(-10px, 0);
      filter: blur(1px);
    }
    100%{
        opacity: 1;
        transform: translate(0);
        filter: blur(0);
    }
}@keyframes op {
    0%{
        opacity: 0;
        transform: translate(0,-30px);
        filter: blur(4px);
    }
    60% {
      opacity: 0.6;
      transform: translate(0,-10px);
      filter: blur(1px);
    }
    100%{
        opacity: 1;
        transform: translate(0);
        filter: blur(0);
    }
}
  .box {
    overflow: hidden;
    font-family: "华文中宋";
    display: flex;
    width: 100vw;
    height: 100vh;
    background-image: url(../../assets/bg.png);
  }
  .nav {
    padding: 0 20px;
    animation: op2 0.8s linear;
    position: relative;
    display: flex;
    padding-top: 80px;
    flex-direction: column;
    align-items: center;
    width: 18vw;
    height: 100vh;
    box-shadow:  20px 0 30px rgba(0,0,0,0.2), 0 10px 100px rgba(0,0,0,0.3);
  }
  .nav::after {
    position: absolute;
    content: '';
    right: 15px;
    top:0;
    height: 80vh;
    width: 2px;
    background-color: #fff;
  }
  .red {
    color: rgb(153, 43, 46);
  }
  .nav::before {
    position: absolute;
    content: '';
    right: 0;
    top: 95px;
    width: 15px;
    height: 1.5px;
    background-color: #fff;
  }
  .nav h2 {
    font-weight: 400;
    color: rgb(153, 43, 46);
  }
  .nav ul {
    margin-top: 20px;
    display: flex;
    flex-direction: column;
    justify-content: space-around;
    flex: 0.8;
  }
  .nav li {
    cursor: pointer;
    font-size: 18px;
    text-align: center;
  }
  .nav li:hover {
    color: rgb(153, 43, 46);
  }
  .ziBox {
    display: flex;
    align-items: center;
    position: relative;
    padding-left: 20px;
    flex: 1;
  }

.get {
  cursor: pointer;
  position: absolute;
  right: 13vw;
  bottom: 14vh;
  display: flex;
  justify-content: space-between;
  align-items: center;
  width: 100px;
  height: 40px;
  font-size: 26px;
}
.get i {
  font-size: 26px;
  font-weight: 900;
}
.textBox {
  margin-left: 15vw;
            width: 40vw;
            border:1.5px solid #000;
            border-bottom: 0;
            font-size: 13px;
        }
        .t {
            display: flex;
            justify-content: space-around;
        }
        .h2 {
          font-weight: 900;
font-size: 15px;
          padding: 0 5px;
          display: flex;
          align-items: center;
          border-bottom:1.5px solid #000;
          border-right: 1.5px solid #000;
        }
        .text {
        text-indent: 2em;
          padding: 4px;
            flex: 1;
          height: 100%;

        }
        .title {
          font-weight: 900;
          font-size: 20px;
          line-height: 5vh;
          text-align: center;
            width: 100%;
            height: 5vh;
            border-bottom: 1.5px solid #000;
        }
        .text {
            border-bottom: 1.5px solid #000;
        }
</style>
