<template>
  <div class="boxBox">
    <!-- 背景贴图 -->
    <div class="bgtext1"></div>
    <!--书 -->
    <div class="book" @mouseenter="sho">
      <!-- 书题 -->
      <div class="cover">
        <span>{{ list5[list1Key] }}</span>
      </div>
      <!-- 字 -->
      <div class="content">
        <p>{{ text1 }}</p>
      </div>
    </div>
    <!-- 选择民法典编 -->
    <div class="selectBox">
      <div class="js">简述</div>
      <div class="selecttext" ref="booktext">{{ text2 }}</div>
      <div class="select">
        <li ref="li" v-for="(item,index) in list5" :key="index" @click="bookList(index)" :class="{lihover: index===list1Key}">{{ item }}</li>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'BookBox',
  data () {
    return {
      // 默认总则
      text2: '“总则编”覆盖民法各编，形成了总分结合、动静结合的法典结构。 在静态上规定了自然人、法人、非法人组织三类主体，民事权利、民事责任等民事法律关系的内容，在动态上规定了民事法律行为、代理、诉讼时效等法律关系变动原因。 “总则编”实现了制度传承与学说借鉴的结合',
      // 字
      text1: '',
      // 决定哪个编
      list1Key: 0,
      // 编名
      list5: ['总则编', '物权编',
        '合同编',
        '人格权编',
        '婚姻家庭编',
        '继承编',
        '侵权责任编'],
      // 简述
      list21: ['“总则编”覆盖民法各编，形成了总分结合、动静结合的法典结构。 在静态上规定了自然人、法人、非法人组织三类主体，民事权利、民事责任等民事法律关系的内容，在动态上规定了民事法律行为、代理、诉讼时效等法律关系变动原因。 “总则编”实现了制度传承与学说借鉴的结合', '《民法典》物权编调整的是物的归属和利用所产生的民事法律关系，主要是调整民事主体和民事主体之间的利益关系，同时，因物的归属和利用而在民事主体和公共利益之间产生的法律关系，也可由物权编进行调整', '《民法典》合同编是在现行《合同法》基础上结合司法实践，对市场交易设立的基本规则进行了完善，对民生生活和市场交易具有重要意义。合同编包括了合同的成立、效力、履行、保全等方面的规定，以及电子合同、预约合同、格式条款等新的制度', '《民法典》人格权编规定了人格权的一般规则，以及生命权、身体权、健康权，姓名权、名称权，肖像权，名誉权、荣誉权，隐私权和个人信息保护等内容。人格权编强调对侵权的事后救济，也强调对损害的事前预防。它代表了我国对人格权正面确权和积极保护的最高水平，体现了我国社会对人格尊严和人格权的普遍尊重和全面保护', '《民法典》婚姻家庭编作为规范夫妻关系和家庭关系的基本准则，强调了婚姻自由、一夫一妻、男女平等的婚姻制度，保护妇女、未成年人、老年人、残疾人的合法权益', '民法典继承编在继承法的基础上修改完善了继承制度，共4章45条。其中，适当扩大了法定继承人的范围，增加了被继承人的兄弟姐妹的子女的代位继承制度。此外，民法典继承编还明确了自然人可以设立遗嘱信托，增加了新的遗嘱形式，完善了遗产抚养协议制度，以及明确了归国家所有的无人继承遗产应当用于公益事业', '《民法典》侵权责任编是在侵权责任法基础上制定的，总结实践经验，针对侵权领域出现的新情况，对侵权责任制度作了必要的补充和完善'],
      list1: [['第一条 为了保护民事主体的合法权益，调整民事关系，维护社会和经济秩序，适应中国特色社会主义发展要求，弘扬社会主义核心价值观，根据宪法，制定本法。',
        '第二条 民法调整平等主体的自然人、法人和非法人组织之间的人身关系和财产关系。',
        '第三条 民事主体的人身权利、财产权利以及其他合法权益受法律保护，任何组织或者个人不得侵犯。',
        '第六条 民事活动应当遵循自愿原则，按照自己的意愿设立、变更、终止民事关系。',
        '第七条 民事活动应当遵循公平原则，合理确定各方的权利和义务。',
        '第九条 民事活动不得违反法律、行政法规的强制性规定，不得违背公序良俗。',
        '第十条 处理民事纠纷，应当依照法律规定；法律没有规定的，可以适用习惯，但是不得违背公序良俗。', '第十六条，涉及遗产继承、接受赠与等胎儿利益保护的，胎儿视为具有民事权利能力。但是胎儿娩出时为死体的，其民事权利能力自始不存在',
        '第二十二条，不能完全辨认自己行为的成年人为限制民事行为能力人，实施民事法律行为由其法定代理人代理或者经其法定代理人同意、追认；但是，可以独立实施纯获利益的民事法律行为或者与其智力、精神健康状况相适应的民事法律行为。',
        '第八十一条 人民法院审理第二审民事案件，由审判员三人至五人组成合议庭审理。',
        '第八十二条 适用简易程序审理的案件，由审判员一人独任审理。',
        '第八十三条 适用特别程序审理的案件，由审判员一人独任审理。',
        '第八十四条 人民法院审理民事案件，应当根据当事人自愿和合法的原则进行调解。',
        '第八十五条 调解达成协议，人民法院应当制作调解书，由审判员签名，加盖人民法院印章，送达当事人。',
        '第八十七条 人民法院审理民事案件，应当在开庭三日前通知当事人和其他诉讼参与人。',
        '第八十八条 人民法院审理民事案件，应当公开进行。但是，法律另有规定的除外。',
        '第一百零一条，居民委员会、村民委员会具有基层群众性自治组织法人资格，可以从事为履行职能所需要的民事活动。未设立村集体经济组织的，村民委员会可以依法代行村集体经济组织的职能。',
        '第一百二十七条，法律对数据、网络虚拟财产的保护有规定的，依照其规定。',
        '第一百八十四条，因自愿实施紧急救助行为造成受助人损害的，救助人不承担民事责任。',
        '第一百八十八条，向人民法院请求保护民事权利的诉讼时效期间为三年。',
        '第一百八十三条，因保护他人民事权益使自己受到损害的，由侵权人承担民事责任，受益人可以给予适当补偿。没有侵权人、侵权人逃逸或者无力承担民事责任，受害人请求补偿的，受益人应当给予适当补偿。'],
      ['第二百零五条 本编调整因物的归属和利用产生的民事关系。',
        '第二百零六条 国家坚持和完善公有制为主体、多种所有制经济共同发展，按劳分配为主体、多种分配方式并存，社会主义市场经济体制等社会主义基本经济制度。',
        '第二百零七条 国家、集体、私人的物权和其他权利人的物权受法律平等保护，任何组织或者个人不得侵犯。',
        '第二百零八条 不动产物权的设立、变更、转让和消灭，应当依照法律规定登记。',
        '第二百零九条 不动产物权的设立、变更、转让和消灭，经依法登记，发生效力；未经登记，不发生效力，但是法律另有规定的除外。',
        '第二百一十条 不动产登记，由不动产所在地的登记机构办理。',
        '第二百一十一条 当事人申请登记，应当根据不同登记事项提供权属证明和不动产界址、面积等必要材料。',
        '第二百一十二条 登记机构应当履行下列职责：（一）查验申请人提供的权属证明和其他必要材料；（二）就有关登记事项询问申请人；（三）如实、及时登记有关事项；（四）法律、行政法规规定的其他职责。',
        '第二百一十三条 登记机构不得有下列行为：（一）要求对不动产进行评估；（二）以年检等名义进行重复登记；（三）超出登记职责范围的其他行为。',
        '第二百一十四条 不动产权属证书是权利人享有该不动产物权的证明。', '第二百二十二条 统一登记的范围、登记机构和登记办法，由法律、行政法规规定。',
        '第二百二十三条 不动产登记费按件收取，不得按照不动产的面积、体积或者价款的比例收取。',
        '第二百二十四条 动产物权的设立和转让，自交付时发生效力，但是法律另有规定的除外。',
        '第二百五十一条 动产抵押权的设立，应当以书面形式订立抵押合同，合同自双方签字盖章时生效。','二百九十七条  不动产或者动产可以由两个以上组织、个人共有。共有包括按份共有和共同共有。','第二百九十八条  按份共有人对共有的不动产或者动产按照其份额享有所有权。','第二百九十九条  共同共有人对共有的不动产或者动产共同享有所有权。','第三百条  共有人按照约定管理共有的不动产或者动产；没有约定或者约定不明确的，各共有人都有管理的权利和义务。','第三百零一条  处分共有的不动产或者动产以及对共有的不动产或者动产作重大修缮、变更性质或者用途的，应当经占份额三分之二以上的按份共有人或者全体共同共有人同意，但是共有人之间另有约定的除外。','第三百零二条  共有人对共有物的管理费用以及其他负担，有约定的，按照其约定；没有约定或者约定不明确的，按份共有人按照其份额负担，共同共有人共同负担。'
    ,'第三百一十三条 善意受让人取得动产后，该动产上的原有权利消灭。但是，善意受让人在受让时知道或者应当知道该权利的除外。'],
  [
    '第五百一十四条  以支付金钱为内容的债，除法律另有规定或者当事人另有约定外，债权人可以请求债务人以实际履行地的法定货币履行。','第五百一十六条  当事人行使选择权应当及时通知对方，通知到达对方时，标的确定。标的确定后不得变更，但是经对方同意的除外。','第五百一十七条  债权人为二人以上，标的可分，按照份额各自享有债权的，为按份债权；债务人为二人以上，标的可分，按照份额各自负担债务的，为按份债务。','第五百一十八条  债权人为二人以上，部分或者全部债权人均可以请求债务人履行债务的，为连带债权；债务人为二人以上，债权人可以请求部分或者全部债务人履行全部债务的，为连带债务。','第五百二十二条  当事人约定由债务人向第三人履行债务，债务人未向第三人履行债务或者履行债务不符合约定的，应当向债权人承担违约责任。','第五百二十三条  当事人约定由第三人向债权人履行债务，第三人不履行债务或者履行债务不符合约定的，债务人应当向债权人承担违约责任。','第五百二十四条  债务人不履行债务，第三人对履行该债务具有合法利益的，第三人有权向债权人代为履行；但是，根据债务性质、按照当事人约定或者依照法律规定只能由债务人履行的除外。','　第五百二十五条  当事人互负债务，没有先后履行顺序的，应当同时履行。一方在对方履行之前有权拒绝其履行请求。一方在对方履行债务不符合约定时，有权拒绝其相应的履行请求。','第五百二十六条  当事人互负债务，有先后履行顺序，应当先履行债务一方未履行的，后履行一方有权拒绝其履行请求。先履行一方履行债务不符合约定的，后履行一方有权拒绝其相应的履行请求。','第五百三十七条  人民法院认定代位权成立的，由债务人的相对人向债权人履行义务，债权人接受履行后，债权人与债务人、债务人与相对人之间相应的权利义务终止。债务人对相对人的债权或者与该债权有关的从权利被采取保全、执行措施，或者债务人破产的，依照相关法律的规定处理。','第五百三十八条  债务人以放弃其债权、放弃债权担保、无偿转让财产等方式无偿处分财产权益，或者恶意延长其到期债权的履行期限，影响债权人的债权实现的，债权人可以请求人民法院撤销债务人的行为。'
  ],
  [
    '　第九百九十六条  因当事人一方的违约行为，损害对方人格权并造成严重精神损害，受损害方选择请求其承担违约责任的，不影响受损害方请求精神损害赔偿。','第九百九十八条  认定行为人承担侵害除生命权、身体权和健康权外的人格权的民事责任，应当考虑行为人和受害人的职业、影响范围、过错程度，以及行为的目的、方式、后果等因素。','第九百九十九条  为公共利益实施新闻报道、舆论监督等行为的，可以合理使用民事主体的姓名、名称、肖像、个人信息等；使用不合理侵害民事主体人格权的，应当依法承担民事责任。','第一千条  行为人因侵害人格权承担消除影响、恢复名誉、赔礼道歉等民事责任的，应当与行为的具体方式和造成的影响范围相当。','第九百九十五条  人格权受到侵害的，受害人有权依照本法和其他法律的规定请求行为人承担民事责任。受害人的停止侵害、排除妨碍、消除危险、消除影响、恢复名誉、赔礼道歉请求权，不适用诉讼时效的规定。','第一千零七条  禁止以任何形式买卖人体细胞、人体组织、人体器官、遗体。','　第一千零九条  从事与人体基因、人体胚胎等有关的医学和科研活动，应当遵守法律、行政法规和国家有关规定，不得危害人体健康，不得违背伦理道德，不得损害公共利益。','第一千零一十条  违背他人意愿，以言语、文字、图像、肢体行为等方式对他人实施性骚扰的，受害人有权依法请求行为人承担民事责任。','第一千零一十一条  以非法拘禁等方式剥夺、限制他人的行动自由，或者非法搜查他人身体的，受害人有权依法请求行为人承担民事责任。','第一千零一十二条  自然人享有姓名权，有权依法决定、使用、变更或者许可他人使用自己的姓名，但是不得违背公序良俗。','第一千零一十三条  法人、非法人组织享有名称权，有权依法决定、使用、变更、转让或者许可他人使用自己的名称。'
  ],
  [
    '第一千零四十一条  婚姻家庭受国家保护。','第一千零四十四条  收养应当遵循最有利于被收养人的原则，保障被收养人和收养人的合法权益。','第一千零四十六条  结婚应当男女双方完全自愿，禁止任何一方对另一方加以强迫，禁止任何组织或者个人加以干涉。','第一千零四十七条  结婚年龄，男不得早于二十二周岁，女不得早于二十周岁。','第一千零四十八条  直系血亲或者三代以内的旁系血亲禁止结婚。','第一千零五十条  登记结婚后，按照男女双方约定，女方可以成为男方家庭的成员，男方可以成为女方家庭的成员。','第一千零四十九条  要求结婚的男女双方应当亲自到婚姻登记机关申请结婚登记。符合本法规定的，予以登记，发给结婚证。完成结婚登记，即确立婚姻关系。未办理结婚登记的，应当补办登记。','第一千零五十二条  因胁迫结婚的，受胁迫的一方可以向人民法院请求撤销婚姻。','第一千零四十八条  直系血亲或者三代以内的旁系血亲禁止结婚。','第一千零五十八条  夫妻双方平等享有对未成年子女抚养、教育和保护的权利，共同承担对未成年子女抚养、教育和保护的义务。','第一千零五十七条  夫妻双方都有参加生产、工作、学习和社会活动的自由，一方不得对另一方加以限制或者干涉。'
  ],
  [
    '第一千一百二十三条  继承开始后，按照法定继承办理；有遗嘱的，按照遗嘱继承或者遗赠办理；有遗赠扶养协议的，按照协议办理。','第一千一百一十九条  本编调整因继承产生的民事关系。','第一千一百二十条  国家保护自然人的继承权。','第一千一百二十一条  继承从被继承人死亡时开始。','第一千一百二十九条  丧偶儿媳对公婆，丧偶女婿对岳父母，尽了主要赡养义务的，作为第一顺序继承人。','第一千一百三十一条  对继承人以外的依靠被继承人扶养的人，或者继承人以外的对被继承人扶养较多的人，可以分给适当的遗产。','第一千一百三十二条  继承人应当本着互谅互让、和睦团结的精神，协商处理继承问题。遗产分割的时间、办法和份额，由继承人协商确定；协商不成的，可以由人民调解委员会调解或者向人民法院提起诉讼。','第一千一百三十四条  自书遗嘱由遗嘱人亲笔书写，签名，注明年、月、日。','第一千一百三十五条  代书遗嘱应当有两个以上见证人在场见证，由其中一人代书，并由遗嘱人、代书人和其他见证人签名，注明年、月、日。','第一千一百三十六条  打印遗嘱应当有两个以上见证人在场见证。遗嘱人和见证人应当在遗嘱每一页签名，注明年、月、日。','第一千一百三十七条  以录音录像形式立的遗嘱，应当有两个以上见证人在场见证。遗嘱人和见证人应当在录音录像中记录其姓名或者肖像，以及年、月、日。'
  ],
  [
    '第一千一百六十四条  本编调整因侵害民事权益产生的民事关系。','第一千一百六十五条  行为人因过错侵害他人民事权益造成损害的，应当承担侵权责任。依照法律规定推定行为人有过错，其不能证明自己没有过错的，应当承担侵权责任。'
  ,'第一千一百六十六条  行为人造成他人民事权益损害，不论行为人有无过错，法律规定应当承担侵权责任的，依照其规定。','第一千一百六十七条  侵权行为危及他人人身、财产安全的，被侵权人有权请求侵权人承担停止侵害、排除妨碍、消除危险等侵权责任。',
  '第一千一百六十八条  二人以上共同实施侵权行为，造成他人损害的，应当承担连带责任。','第一千一百七十条  二人以上实施危及他人人身、财产安全的行为，其中一人或者数人的行为造成他人损害，能够确定具体侵权人的，由侵权人承担责任；不能确定具体侵权人的，行为人承担连带责任。','第一千一百七十一条  二人以上分别实施侵权行为造成同一损害，每个人的侵权行为都足以造成全部损害的，行为人承担连带责任。',''
      ,'第一千一百七十二条  二人以上分别实施侵权行为造成同一损害，能够确定责任大小的，各自承担相应的责任；难以确定责任大小的，平均承担责任。','第一千一百七十三条  被侵权人对同一损害的发生或者扩大有过错的，可以减轻侵权人的责任。','第一千一百七十四条  损害是因受害人故意造成的，行为人不承担责任。','第一千一百七十五条  损害是因第三人造成的，第三人应当承担侵权责任。','第一千一百七十六条  自愿参加具有一定风险的文体活动，因其他参加者的行为受到损害的，受害人不得请求其他参加者承担侵权责任；但是，其他参加者对损害的发生有故意或者重大过失的除外。','第一千一百七十八条  本法和其他法律对不承担责任或者减轻责任的情形另有规定的，依照其规定。'
]
  ]}
  },
  methods: {
    // 改变民法典中的内容
    bookList (id) {
      this.list1Key = id
      this.text2 = this.list21[this.list1Key]
    },
    sho () {
      // 随机一条
      const index = Math.floor(Math.random() * 10)
      const key = this.list1Key
      this.text1 = this.list1[key][index]
    }
  }
}
</script>

<style scoped>
/* 打开页面动画 */
@keyframes op {
    0%{
        opacity: 0;
        transform: translate(-100px,0);
        filter: blur(4px);
    }
    60% {
      opacity: 0.6;
      transform: translate(-40px,0);
      filter: blur(1px);
    }
    100%{
        opacity: 1;
        transform: translate(0);
        filter: blur(0);
    }
}
@keyframes op2 {
    0%{
        opacity: 0;
        transform: translate(60px,0);
        filter: blur(4px);
    }
    60% {
      opacity: 0.6;
      transform: translate(20px, 0);
      filter: blur(1px);
    }
    100%{
        opacity: 1;
        transform: translate(0);
        filter: blur(0);
    }
}
/* 选择编 */
.selectBox {
  animation: op2 1.2s linear;
  height: 100vh;
  width: 42vw;
  position: absolute;
  right: 0;
  bottom: 0;
  /* background-color: #fff; */
}
.select {
  padding-left: 30px;
  line-height: 65px;
  font-size: 20px;
  width: 35%;
  height: 60%;
  position: absolute;
  right: 0;top:50%;
  transform: translateY(-50%);
}
.select li {
  position: relative;
  cursor: pointer;
  color: rgb(0,0,0,0.4);

}

/*点击样式 */
.select .lihover {
  color: #000;
}
/* 经过样式 */
.select li:hover {
  color: #000;
}
@keyframes jsmove {
  from {
    opacity: 1;
  }
  to {
    opacity: 0;
    transform: translateY(5%);
  }
}
.jsmove {
  animation: jsmove 1s;
}
.js {
  position: absolute;
  top: 8vh;
  left: 20%;
  font-size: 40px;
}
.selecttext{
  padding-top: 10px;
  padding-right: 30px;
  position: absolute;
  top: 50%;
  transform: translateY(-50%);
  width: 65%;
  height: 65%;
  font-size: 26px;
}
.select::after {
  position: absolute;
  top: 0;
  left: 0;
  content: '';
  width: 1.5px;
  height: 100%;
  background-image: linear-gradient(to bottom,rgba(210, 210, 210,0.3),rgb(210, 210, 210),rgba(210, 210, 210,0.3));
}
@keyframes none {
  from {
    opacity: 1;
  }
  to {
    opacity: 0;
    display: none;
    transform: translateX(30px);
  }
}
.none {
  animation: none 1.5s forwards;
}
.boxBox {
  font-family: "隶书";
  position: relative;
  align-items: center;
  width: 100vw;
  height: 100vh;
  /* background-size: cover; */
}
.bgtext1 {
  position: absolute;
  top: 40%;
  transform: translate(-50%,-50%);
  left:  50%;
  width: 250px;
  height: 220px;
  background-image: url(./images/bgtext1.png);
  background-size:contain;
  background-repeat: no-repeat;
}
.book {
  animation: op 1s linear;
  position: absolute;
  left: 10%;
  top: 22%;
  margin: 0 100px 100px 0;
  cursor: pointer;
  width: 300px;
  height: 400px;
  background-color: #fff;
  /* 开启3D */
  transform-style: preserve-3d;
  perspective: 700px;
  /* 设置阴影 */
  box-shadow: inset 450px 0 30px rgba(0,0,0,0.2), 0 10px 100px rgba(0,0,0,0.3);
  transition: 1.5s;
}
.book:hover {
  transform: rotate(-8deg) translateX(90%);
  box-shadow: inset 20px 0 30px rgba(0,0,0,0.2),0 10px 100px rgba(0,0,0,0.3);
}
.book::before {
  content: '';
  position: absolute;
  left: 0;
  top: -5px;
  width: 100%;
  height: 5px;
  background-color: rgb(41, 41, 30);
  transform-origin: bottom;
  transform: skewX(-45deg);
}
.book::after{
  content: '';
  position: absolute;
  top:0;
  right: -5px;
  width: 5px;
  height: 100%;
  background-color: rgb(41, 41, 41);
  transform-origin: left;
  transform: skewY(-45deg);
}
.book .cover {
  width: 100%;
  height: 100%;
  background-color: rgb(60, 56, 53);
  display: flex;
  justify-content: center;
  align-items: center;
  position: relative;
  transform-origin: left;
  transition: 1.5s;
}
.cover::after {
  position: absolute;
  content: '';
  width: 1.5px;
  height: 100%;
  left: 25px;
  background-color: rgb(40, 36, 33);
}
.book .cover span{
  position: absolute;
  right: 20px;
  top: 20px;
  background-color: #fff;
  font-size: 40px;
  font-family: "隶书";
  /* 文本竖向 */
  writing-mode: vertical-lr;
  padding: 5px 3px 3px 3px;
  /* letter-spacing: 5px; */
}
.book:hover .cover {
  transform: rotateY(-135deg)
}
.book .content {
  width: 100%;
  height: 100%;
  position: absolute;
  padding-left: 8px;
  top:0;
  left: 0;
  z-index: -1;
  font-size: 25px;
  font-family: "隶书";
  line-height: 30px;
  letter-spacing: 5px;
  display: flex;
  justify-content: center;
  align-items: center;
}
</style>
